namespace UnityEngine.Services.LocalizeService
{
    public enum LANG
    {
        ar_EG = 1001, //阿拉伯
        bg_BG = 1002, //保加利亚语
        ca_ES = 1003, //加泰罗尼亚语
        cs_CZ = 1004, //捷克语
        de_DE = 1005, //德语
        el_GR = 1006, //希腊语
        en_GB = 1007, //英语
        en_US = 1008, //英语（美式）
        es_ES = 1009, //西班牙语
        et_EE = 1010, //爱沙尼亚语
        fa_IR = 1011, //波斯语
        fi_FI = 1012, //芬兰语
        fr_BE = 1013, //法语（比利时）
        fr_FR = 1014, //法语
        he_IL = 1015, //希伯来语
        hi_IN = 1016, //印地语
        hu_HU = 1017, //匈牙利
        is_IS = 1018, //冰岛语
        id_ID = 1019, //印度尼西亚语
        it_IT = 1020, //意大利语
        ja_JP = 1021, //日语
        kn_IN = 1022, //卡纳达语
        ko_KR = 1023, //韩语/朝鲜语
        nb_NO = 1024, //挪威
        ne_NP = 1025, //尼泊尔语
        nl_BE = 1026, //荷兰语（比利时）
        nl_NL = 1027, //荷兰语
        pl_PL = 1028, //波兰语
        pt_BR = 1029, //葡萄牙语(巴西)
        pt_PT = 1030, //葡萄牙语
        sk_SK = 1031, //斯洛伐克语
        sr_RS = 1032, //塞尔维亚
        sl_SI = 1033, //斯洛文尼亚
        sv_SE = 1034, //瑞典语
        th_TH = 1035, //泰语
        tr_TR = 1036, //土耳其语
        ru_RU = 1037, //俄罗斯语
        uk_UA = 1038, //乌克兰语
        vi_VN = 1039, //越南语
        zh_CN = 1040, //简体中文
        zh_TW = 1041, //繁体中文
    }
}